### ⚠️ Terraform Plan: Changes detected

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.gcp.google_project_service.cloudresourcemanager: Refreshing state... [id=main-vcompute/cloudresourcemanager.googleapis.com]
module.gcp.google_project_service.storage: Refreshing state... [id=main-vcompute/storage.googleapis.com]
module.gcp.google_project_service.logging: Refreshing state... [id=main-vcompute/logging.googleapis.com]
module.gcp.google_service_account.main: Refreshing state... [id=projects/main-vcompute/serviceAccounts/tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_service.compute: Refreshing state... [id=main-vcompute/compute.googleapis.com]
module.gcp.google_service_account.terraform: Refreshing state... [id=projects/main-vcompute/serviceAccounts/tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_service.monitoring: Refreshing state... [id=main-vcompute/monitoring.googleapis.com]
module.gcp.google_project_service.iam: Refreshing state... [id=main-vcompute/iam.googleapis.com]
module.gcp.google_project_service.appengine: Refreshing state... [id=main-vcompute/appengine.googleapis.com]
module.gcp.google_project_service.servicenetworking: Refreshing state... [id=main-vcompute/servicenetworking.googleapis.com]
module.gcp.google_project_service.artifactregistry: Refreshing state... [id=main-vcompute/artifactregistry.googleapis.com]
module.gcp.google_project_service.sqladmin: Refreshing state... [id=main-vcompute/sqladmin.googleapis.com]
module.gcp.google_project_iam_member.terraform_network_admin: Refreshing state... [id=main-vcompute/roles/compute.networkAdmin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_wip_admin: Refreshing state... [id=main-vcompute/roles/iam.workloadIdentityPoolAdmin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_storage_admin: Refreshing state... [id=main-vcompute/roles/storage.admin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_sa_user: Refreshing state... [id=main-vcompute/roles/iam.serviceAccountUser/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_iam_admin: Refreshing state... [id=main-vcompute/roles/resourcemanager.projectIamAdmin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_appengine_admin: Refreshing state... [id=main-vcompute/roles/appengine.appAdmin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_sa_admin: Refreshing state... [id=main-vcompute/roles/iam.serviceAccountAdmin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_service_usage: Refreshing state... [id=main-vcompute/roles/serviceusage.serviceUsageAdmin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_service.iamcredentials: Refreshing state... [id=main-vcompute/iamcredentials.googleapis.com]
module.gcp.google_project_iam_member.terraform_sql_admin: Refreshing state... [id=main-vcompute/roles/cloudsql.admin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.terraform_artifact_admin: Refreshing state... [id=main-vcompute/roles/artifactregistry.admin/serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.monitoring_writer: Refreshing state... [id=main-vcompute/roles/monitoring.metricWriter/serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.artifact_reader: Refreshing state... [id=main-vcompute/roles/artifactregistry.reader/serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.logging_writer: Refreshing state... [id=main-vcompute/roles/logging.logWriter/serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.sql_client: Refreshing state... [id=main-vcompute/roles/cloudsql.client/serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_project_iam_member.storage_viewer: Refreshing state... [id=main-vcompute/roles/storage.objectViewer/serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com]
module.gcp.google_compute_network.main: Refreshing state... [id=projects/main-vcompute/global/networks/tut-bus-network]
module.gcp.google_app_engine_application.main: Refreshing state... [id=main-vcompute]
module.gcp.google_compute_global_address.private_ip_address: Refreshing state... [id=projects/main-vcompute/global/addresses/tut-bus-private-ip-address]
module.gcp.google_compute_subnetwork.main: Refreshing state... [id=projects/main-vcompute/regions/asia-northeast1/subnetworks/tut-bus-subnet]
module.gcp.google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Fmain-vcompute%2Fglobal%2Fnetworks%2Ftut-bus-network:servicenetworking.googleapis.com]
module.gcp.google_app_engine_domain_mapping.main: Refreshing state... [id=apps/main-vcompute/domainMappings/tut-bus-api.hekuta.net]
module.gcp.google_sql_database_instance.main: Refreshing state... [id=tut-bus-db-prod]
module.gcp.google_sql_database.main: Refreshing state... [id=projects/main-vcompute/instances/tut-bus-db-prod/databases/tutbus]
module.gcp.google_sql_user.iam_user: Refreshing state... [id=tut-bus-app-sa@main-vcompute.iam//tut-bus-db-prod]
module.gcp.google_iam_workload_identity_pool.github: Refreshing state... [id=projects/main-vcompute/locations/global/workloadIdentityPools/tut-bus-github-pool]
module.gcp.google_service_account_iam_member.workload_identity_user: Refreshing state... [id=projects/main-vcompute/serviceAccounts/tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/897661050223/locations/global/workloadIdentityPools/tut-bus-github-pool/attribute.repository/lc-tut/tut-bus]
module.gcp.google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/main-vcompute/locations/global/workloadIdentityPools/tut-bus-github-pool/providers/tut-bus-github-provider]
module.cloudflare.data.cloudflare_zone.main: Reading...
module.cloudflare.data.cloudflare_zone.main: Read complete after 1s [id=2eb08d674eadc0c497d982871450e73e]
module.cloudflare.cloudflare_zone_setting.min_tls_version: Refreshing state... [id=min_tls_version]
module.cloudflare.cloudflare_zone_setting.ssl: Refreshing state... [id=ssl]
module.cloudflare.cloudflare_zone_setting.tls_1_3: Refreshing state... [id=tls_1_3]
module.cloudflare.cloudflare_zone_setting.always_use_https: Refreshing state... [id=always_use_https]
module.cloudflare.cloudflare_zone_setting.http3: Refreshing state... [id=http3]
module.cloudflare.cloudflare_dns_record.api: Refreshing state... [id=5a9ede8a6ce6181096c2573187b232d0]
module.vercel.vercel_project.main: Refreshing state... [id=prj_ta1sUOqYijyfarPliK1sCzMgPGuU]
module.vercel.vercel_project_environment_variable.better_auth_secret: Refreshing state... [id=FkaKjpEkqJVkVAIX]
module.vercel.vercel_project_environment_variable.app_url_production: Refreshing state... [id=zRYolmZAgsQ7YNja]
module.vercel.vercel_project_environment_variable.announcement_title[0]: Refreshing state... [id=9x2XVPxcVQYEbNwL]
module.vercel.vercel_project_environment_variable.announcement_type[0]: Refreshing state... [id=W56FUcAPsLBuHT9m]
module.vercel.vercel_project_domain.custom_domain[0]: Refreshing state... [id=tut-bus.lcn.ad.jp]
module.vercel.vercel_project_environment_variable.auth_github_id: Refreshing state... [id=FheTOSCfUktxaZMS]
module.vercel.vercel_project_environment_variable.auth_github_secret: Refreshing state... [id=t8dplHd0eiYBL9G7]
module.vercel.vercel_project_environment_variable.enable_corepack: Refreshing state... [id=2ayLvYXUkEv4jjWR]
module.vercel.vercel_project_domain.vercel_app_redirect[0]: Refreshing state... [id=tut-bus-web.vercel.app]
module.vercel.vercel_project_environment_variable.announcement_message[0]: Refreshing state... [id=jWcmmfrIQwZ2ilLs]
module.vercel.vercel_project_environment_variable.announcement_link_url[0]: Refreshing state... [id=HQlItLGH01djcN4K]
module.vercel.vercel_project_domain.redirect_domains["tut-bus.hekuta.net"]: Refreshing state... [id=tut-bus.hekuta.net]
module.vercel.vercel_project_environment_variable.api_url_production: Refreshing state... [id=XDIdV4P6lHRBdGiJ]
module.vercel.vercel_project_deployment_retention.main[0]: Refreshing state... [id=team_kIKSNppKX4A6hEGHw7pLgbPV/prj_ta1sUOqYijyfarPliK1sCzMgPGuU]
module.vercel.vercel_project_environment_variable.auth_allowed_team[0]: Refreshing state... [id=4aL3KkF7eLhrpUs5]
module.vercel.vercel_project_environment_variable.ga_id[0]: Refreshing state... [id=5IX17COFeIWDswkN]
module.vercel.vercel_project_environment_variable.announcement_link_text[0]: Refreshing state... [id=hPKzWMkE2x4uU21y]
module.vercel.vercel_project_environment_variable.api_url_preview: Refreshing state... [id=Gcpv4ICO9QRt7qT2]
module.vercel.vercel_project_environment_variable.api_url_development: Refreshing state... [id=EXdxqGlu1U6l1HVY]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.vercel.vercel_project.main will be updated in-place
  ~ resource "vercel_project" "main" {
      + enable_preview_feedback                           = (known after apply)
      + git_provider_options                              = (known after apply)
        id                                                = "prj_ta1sUOqYijyfarPliK1sCzMgPGuU"
        name                                              = "tut-bus-web"
      + preview_comments                                  = (known after apply)
      ~ prioritise_production_builds                      = false -> true
      + protection_bypass_for_automation_secret           = (sensitive value)
      ~ resource_config                                   = {
          ~ fluid                     = true -> (known after apply)
          + function_default_cpu_type = (known after apply)
          ~ function_default_regions  = [
              - "iad1",
            ] -> (known after apply)
          + function_default_timeout  = (known after apply)
        } -> (known after apply)
      ~ serverless_function_region                        = "iad1" -> (known after apply)
        # (22 unchanged attributes hidden)
    }

  # module.vercel.vercel_project_environment_variable.auth_github_secret must be replaced
-/+ resource "vercel_project_environment_variable" "auth_github_secret" {
      + comment                = (known after apply)
      ~ custom_environment_ids = [] -> (known after apply)
      ~ id                     = "t8dplHd0eiYBL9G7" -> (known after apply)
      ~ sensitive              = false -> true # forces replacement
      ~ team_id                = "team_kIKSNppKX4A6hEGHw7pLgbPV" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.vercel.vercel_project_environment_variable.better_auth_secret must be replaced
-/+ resource "vercel_project_environment_variable" "better_auth_secret" {
      + comment                = (known after apply)
      ~ custom_environment_ids = [] -> (known after apply)
      ~ id                     = "FkaKjpEkqJVkVAIX" -> (known after apply)
      ~ sensitive              = false -> true # forces replacement
      ~ team_id                = "team_kIKSNppKX4A6hEGHw7pLgbPV" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @HEKUCHAN, Branch: `fix/terraform-error`*